Revit 2027 API
ParameterTypeId.AnyPatternIdParam Property
 "Fill Pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnyPatternIdParam { get; }
Public Shared ReadOnly Property AnyPatternIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnyPatternIdParam {
	ForgeTypeId^ get ();
}
static member AnyPatternIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace